
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/portfolio/actions/runs/16169669033)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_service.google_cloud_run_v2_service_iam_member.public_access: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "cloudrun_service" {
      - client                  = "gcloud" -> null
      - client_version          = "523.0.1" -> null
        id                      = "projects/portfolio-460206/locations/asia-northeast1/services/frontend-main"
        name                    = "frontend-main"
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cloudrun_service_auth.google_cloud_run_v2_service.cloudrun_service will be created
  + resource "google_cloud_run_v2_service" "cloudrun_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "auth-service-main"
      + observed_generation     = (known after apply)
      + project                 = "portfolio-460206"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "nginx:latest"

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }
        }

      + traffic (known after apply)
    }

  # module.cloudrun_service_auth.google_cloud_run_v2_service_iam_member.public_access will be created
  + resource "google_cloud_run_v2_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "auth-service-main"
      + project  = "portfolio-460206"
      + role     = "roles/run.invoker"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
module.cloudrun_service_auth.google_cloud_run_v2_service.cloudrun_service: Creating...
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Modifying... [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Modifications complete after 3s [id=projects/portfolio-460206/locations/asia-northeast1/services/frontend-main]
module.cloudrun_service_auth.google_cloud_run_v2_service.cloudrun_service: Still creating... [00m10s elapsed]
module.cloudrun_service_auth.google_cloud_run_v2_service.cloudrun_service: Creation complete after 14s [id=projects/portfolio-460206/locations/asia-northeast1/services/auth-service-main]
module.cloudrun_service_auth.google_cloud_run_v2_service_iam_member.public_access: Creating...
module.cloudrun_service_auth.google_cloud_run_v2_service_iam_member.public_access: Creation complete after 6s [id=projects/portfolio-460206/locations/asia-northeast1/services/auth-service-main/roles/run.invoker/allUsers]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":52,"Program":"tfcmt","SHA1":"69ee5e8014a4496bf28040dcb22874db973931cb","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->